# Series in Pandas

In [1]:
#import pandas and numpy
import numpy as np
import pandas as pd

In [2]:
#lets creat list, lable, disctionary, and numpy array
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [3]:
#Convert your list, numpy array, and disctionary into the series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
#creat two series and grab information from the indexes (make your own series)
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [5]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan']) 
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [6]:
ser1['USA']

1

In [7]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames in Pandas

In [8]:
#import randn from the numpy library and set the seed
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [9]:
#generate random numbers in dataframe with 5 rows and 4 columns and set the column name (w,x,y,z)

##### Solution #####
#df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

##### My Answer #####
df = pd.DataFrame(randn(20).reshape(5,4), index=list('ABCDE'), columns=list('WXYZ'))
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#grab information of first and last column

##### Solution #####
#df[['W','Z']]

##### My Answer #####
df.iloc[:,[0, len(df.columns)-1]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [11]:
#creat new column in your dataframe which contains the sum of column W and Y, name it as 'new'

##### Solution #####
# df['new']= df['W'] + df['Y']

##### My Answer #####
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [12]:
#remove the generated column from your dataframe (use drop() function)

##### Solution #####
# df.drop('new',axis=1)

##### My Answer #####
df.drop('new', 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
#print out the df (you still can see the removed column)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [14]:
#drop the 'new' column permanently (Hint: use inplace)

##### Solution #####
# df.drop('new',axis=1,inplace=True)

##### My Answer #####
df.drop('new', 1, inplace=True)

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
#drop the last row from your dataframe (use axis for droping)

##### Solution #####
#df.drop('E', axis=0)

##### My Answer #####
df.drop(df.index[len(df.index)-1], 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [17]:
#select your first row from your dataframe

##### Solution #####
#df.loc[['A']]

##### My Answer #####
df.iloc[[0]]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [18]:
#select subset of rows and columns from your dataframe 
#(information from column w and y and rows A and B )

##### Solution #####
# df.loc[['A','B'],['W','Y']]

##### My Answer #####
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [19]:
#find out the positive numbers from your dataframe with conditional selection

##### Solution #####
# df>0

##### My Answer #####
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
#Reset your dataframe to default 0,1...n index (hint: use reset_index() function)

##### Solution #####
# df>0

##### My Answer #####
df.reset_index(drop=True)

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [21]:
#add new column (State= 'CA, NY, WY, OR, CO') and set that column as an index to your dataframe
#and set inplace=true

##### Solution #####
#newind = 'CA NY WY OR CO'.split()
#df['States'] = newind
#df.set_index('States')

##### My Answer #####
df['State'] = ['CA', 'NY', 'WY', 'OR', 'CO']
df.set_index('State')

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [22]:
#set the inplace=true your new dataframe
df.set_index('State', inplace=True)

In [23]:
#obtain summary data on your dataframe (describe function)
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

# Missing Data

In [24]:
#define new (3,3) dataframe by using dictionary
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [25]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
#remove NaN valus from the dataframe (use dropna())
df.dropna()

     A    B  C
0  1.0  5.0  1

In [27]:
#remove the NaN values from all columns (by defining the axis)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [28]:
#set the thresh value of 2 and drop other nan (set thresh=2)
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
#set other name for cells with nan value (use fillna() function)

##### Solution #####
#df.fillna(value='FILL VALUE')

##### My Answer #####
df.fillna("XX")

    A   B  C
0   1   5  1
1   2  XX  2
2  XX  XX  3

In [30]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
#fill the first column nan value with mean of the column

##### Solution #####
#df['A'].fillna(value=df['A'].mean())

##### My Answer #####
df.fillna(df[['A']].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# Groupby

In [122]:
#Creat a dataframe from provided dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [123]:
#let's group them by Company
df.groupby("Company")

In [34]:
#save the new object into the new variable
gb = df.groupby("Company")

In [35]:
#use diffrent aggrigate method to find out the sales for each company (count, mean, min, max,..)
display("--- COUNT ---",gb.count(), 
        "--- FIRST ---",gb.first(), 
        "--- LAST ---",gb.last(),
        "--- MEAN ---",gb.mean(),
        "--- MEDIAN ---",gb.median(),
        "--- MIN ---",gb.min(),
        "--- MAX ---",gb.max(),
        "--- VARIANCE ---",gb.var(),
        "--- ECART-TYPE ---",gb.std(),
        "--- DEVIATION MOYENNE ---",gb.mad(),
        "--- PRODUIT ---",gb.prod(),
        "--- SOMME ---",gb.mad()
       )

'--- COUNT ---'

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

'--- FIRST ---'

        Person  Sales
Company
FB        Carl    243
GOOG       Sam    200
MSFT       Amy    340

'--- LAST ---'

          Person  Sales
Company
FB         Sarah    350
GOOG     Charlie    120
MSFT     Vanessa    124

'--- MEAN ---'

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

'--- MEDIAN ---'

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

'--- MIN ---'

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

'--- MAX ---'

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

'--- VARIANCE ---'

           Sales
Company
FB        5724.5
GOOG      3200.0
MSFT     23328.0

'--- ECART-TYPE ---'

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

'--- DEVIATION MOYENNE ---'

         Sales
Company
FB        53.5
GOOG      40.0
MSFT     108.0

'--- PRODUIT ---'

         Sales
Company
FB       85050
GOOG     24000
MSFT     42160

'--- SOMME ---'

         Sales
Company
FB        53.5
GOOG      40.0
MSFT     108.0

# Operations

In [36]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
#find unique values in col2

##### Solution #####
#df['col2'].unique()

##### My Answer #####
df.col2.unique()

array([444, 555, 666])

In [38]:
#find number of unique numbers in col2

##### Solution #####
#df['col2'].nunique()

##### My Answer #####
df.col2.nunique()

3

In [39]:
#count the unique numbers in col2

##### Solution #####
df['col2'].value_counts() 
#display(HTML(tabulate.tabulate(table, tablefmt='html'))) 

##### My Answer #####
#df.groupby('col2')[['col2']].count()

444    2
555    1
666    1
Name: col2, dtype: int64

In [40]:
#Select from DataFrame using criteria from multiple columns (col1>2 and col2=444)

#df.loc[(df["col1"] > 2) & (df["col2"] == 444)]
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]

In [41]:
#show your newdf
newdf

   col1  col2 col3
3     4   444  xyz

In [42]:
#apply provided function to col1
def times2(x):
    return x*2

#df[['col1']].apply(times2) 
df.apply(lambda x: times2(x) if x.name == 'col1' else x)

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

In [43]:
#find out how many words do we have in col3 (use times2 and apply function)
df[["col3"]].apply(times2)

     col3
0  abcabc
1  defdef
2  ghighi
3  xyzxyz

In [44]:
#calculate the sum of col3 (use apply and len)
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [45]:
#permanently remove the col1 (use del)
del df["col1"]

In [46]:
#df
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [47]:
#print out the column names
list(df.columns)

['col2', 'col3']

In [48]:
#use sort function to sort the values for col2 (use sort_values)
df.sort_values("col2")

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

# lets apply what you learned to the pandas exercises

In [51]:
#1. Import pandas and read in the population_by_county.csv file into a dataframe called pop
# I changed the name of file to population
pop = pd.read_csv("population.csv")
df.shape

(3142, 4)

In [54]:
#2. read the population_by_county.csv and Show the head of the dataframe
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [61]:
#3. What are the column names?
print(list(pop.columns))

['County', 'State', '2010Census', '2017PopEstimate']

In [76]:
#4. How many States are represented in this data set?
# pop['State'].nunique() 
pop.State.nunique()

51

In [82]:
#5. Get a list or array of all the states in the data set
# pop['State'].unique()
pop.State.unique()

array(['South Carolina', 'Louisiana', 'Virginia', 'Idaho', 'Iowa',
       'Kentucky', 'Missouri', 'Oklahoma', 'Colorado', 'Illinois',
       'Indiana', 'Mississippi', 'Nebraska', 'North Dakota', 'Ohio',
       'Pennsylvania', 'Washington', 'Wisconsin', 'Vermont', 'Minnesota',
       'Florida', 'North Carolina', 'California', 'New York', 'Wyoming',
       'Michigan', 'Alaska', 'Maryland', 'Kansas', 'Tennessee', 'Texas',
       'Maine', 'Arizona', 'Georgia', 'Arkansas', 'New Jersey',
       'South Dakota', 'Alabama', 'Oregon', 'West Virginia',
       'Massachusetts', 'Utah', 'Montana', 'New Hampshire', 'New Mexico',
       'Rhode Island', 'Nevada', 'District of Columbia', 'Connecticut',
       'Hawaii', 'Delaware'], dtype=object)

In [130]:
#6. What are the five most common County names in the U.S.?
#pop['County'].value_counts().head()
pop.County.value_counts().to_frame().head(5)

                   County
Washington County      30
Jefferson County       25
Franklin County        24
Jackson County         23
Lincoln County         23

In [127]:
#7. What are the top 5 most populated Counties according to the 2010 Census?
#pop.sort_values('2010Census', ascending=False).head()
pop.sort_values("2010Census", ascending=False).head()

                  County       State  2010Census  2017PopEstimate
1713  Los Angeles County  California     9818605         10163507
628          Cook County    Illinois     5194675          5211263
1209       Harris County       Texas     4092459          4652980
1784     Maricopa County     Arizona     3817117          4307033
2501    San Diego County  California     3095313          3337685

In [140]:
#8. What are the top 5 most populated States according to the 2010 Census?
pop.groupby('State').sum().sort_values("2010Census", ascending=False).head()

            2010Census  2017PopEstimate
State
California    37253956         39536653
Texas         25145561         28304596
New York      19378102         19849399
Florida       18801310         20984400
Illinois      12830632         12802023

In [150]:
#9. How many Counties have 2010 populations greater than 1 million?
#sum(pop['2010Census']>1000000)
pop[pop["2010Census"] >= 1000000].shape[0]

39

In [169]:
#10. How many Counties don't have the word "County" in their name?
# sum(pop['County'].apply(lambda name: 'County' not in name))
sum(pop.County.str.contains("County") == False)

135

In [171]:
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [182]:
#11. Add column that calculate percent change between 2010 Census and 2017 Population Estimate
# pop['PercentChange'] = 100*(pop['2017PopEstimate']-pop['2010Census'])/pop['2010Census']
A,B = '2010Census','2017PopEstimate'
pop["ChangePercent"] = round((pop[[A,B]].pct_change(axis=1)[B])*100, 2)

In [ ]:
pop.head()

In [ ]:
#12. What State have highest estimated percent change between 2010Census and 2017PopulationEstimate
#pop.sort_values("ChangePercent", ascending=False)
pop2 = pop.groupby("State").sum()
pop2["ChangePercent"] = round((pop2[[A,B]].pct_change(axis=1)[B])*100, 2)
pop2.sort_values("ChangePercent", ascending=False).head()